InformationRegisters/ВАТСжурналЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВАТСжурналЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНомера</Name>
					<Comment>Звонящий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаНомер</Name>
					<Comment>Вызываемый</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>callstatus</Name>
					<Comment>Статус завершенного звонка, приходит при HANGUP. Значения: ANSWER или пусто</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>direction</Name>
					<Comment>Вход/исход</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recordUrl</Name>
					<Comment>Путь к записи звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>state</Name>
					<Comment>Состояние звонка (что сейчас со звонком). Значения: START, PREANSWER, IVR, ANSWER, HANGUP</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>time</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>duration</Name>
					<Comment>Длительность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>userkey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, связанный со звонком</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВАТСжурналЗвонков/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрослушатьЗапись(Команда)
	
	recordUrl = Элементы.Список.ТекущиеДанные.recordUrl;		
	Если ЗначениеЗаполнено(recordUrl) Тогда
		ЗапуститьПриложение(recordUrl);
	Иначе
		ПоказатьОповещениеПользователя("Не указан путь к записи.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "КартинкаОбъект" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда
		ПоказатьЗначение(,Элементы.Список.ТекущиеДанные.Объект);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "ЗаписьРазговора" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.recordUrl) Тогда
		ЗапуститьПриложение(Элементы.Список.ТекущиеДанные.recordUrl);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "recordUrl" И ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.recordUrl) Тогда
		ЗапуститьПриложение(Элементы.Список.ТекущиеДанные.recordUrl);
		Отказ = Истина;
	КонецЕсли;
	
	Если Элементы.Список.ТекущийЭлемент.Имя = "Объект" Тогда
		Отказ = Истина;
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Объект) Тогда			
			ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.Объект); 	
		Иначе
			Форма = ПолучитьФорму("Справочник.Партнеры.Форма.ПомощникНового");
			Форма.ТелефонПартнера = Элементы.Список.ТекущиеДанные.СНомера;
			Форма.Открыть();
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры
